# 
x <- 3*(3+5)^2
x

y <- x+1

x + y
x - y
x * y
x / y

x^4

a <- 13

a %% 4 # остача від ділення націло
a %/% 4 # ділення без остачі

## оператори відношення
## > < >= <= != ==

a <- 10
b <- 4
c <- 7

a > b
a <= c

a == b + c

## логічні оператори
## & - логічне і -------------- &&
## | - логічне або -------------- ||
## ! - заперечення

a <- 10
b <- 4
c <- 7

a > b & b < c
a >= c & a < b & a != 6

a > b | b < c
a >= c | a < b | a != 6

a <- c(3,1,7)
b <- c(2,6,5)

a > 6 & b > 5
#a > 6 && b > 5

## приклади

a <- 10
b <- 4

a %% b > 0 #TRUE

## ---------

a <- 7
b <- 12
c <- a - b %% 2

c 

c > 0 & b > a

c < 0 | b > a












